Revit 2027 API
BuiltInFailures.StairRampFailures.CannotOffsetBoundary Property
 Can't create Boundary as an offset of Run Curve
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotOffsetBoundary { get; }
Public Shared ReadOnly Property CannotOffsetBoundary As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotOffsetBoundary {
	FailureDefinitionId^ get ();
}
static member CannotOffsetBoundary : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace